{
  "start": "Привет! Я твой бот-помощник по курсу «Аналитика» от MediaSoft.\n\nХочешь задать вопрос по курсу? Пиши – @XIII7h\n\nВозникли предложения по поводу бота, где-то нашёлся баг? Пиши – @Juli_wi\n\nНапиши /help, чтобы узнать полный список команд.",
  "inf": "Тут ты найдешь дополнительную информацию по лекциям. Ниже предоставлены кнопки – тыкай и погружайся в обучение!",
  "help": "Что же я умею?\n\nОсновные команды:\n\n/start – тут ссылочки на важных ребят. По всем вопросам точно сюда!\n\n/url – бот скинет тебе ссылочку на презенташки с курса.\n\n/inf – тут лежит дополнительная информация по разным разделам курса.\n\n/tests – а вот тут горячо... Тестики по темам лекций!\n\n/homework - получить домашнее задание и задания по лекциям.\n\n/help – повторный список команд.",
  "tests": "Для прохождения теста выберите лекцию:\n\nP.S. Если тест нужно заершить досрочно, просто напиши «Завершить»",
  "url": "По ссылке можно найти оформленные презентации, документы и задания:",
  "дз1": "Лекция 2.\nЗадание 1\n\nПроверка запроса покупателя на наличие несоответствий\n\nКак только запрос получен от покупателя, осуществляется проверка на наличие несоответствий.\nМожет быть три результата проверки на наличие несоответствий:\nНет несоответствий. В таком случае запрос публикуется\nЕсть несоответствия, но они могут быть исправлены. В таком случае запрос возвращается покупателю\nЕсть несоответствия, но они не могут быть исправлены. В таком случае запрос блокируется\nПосле информация о запросе фиксируется в системе и процесс завершается.",
  "дз2": "Лекция 2.\nЗадание 2\n\nПроцесс оформления ипотечной заявки\n\nКогда представителю службы поддержки приходит сообщение о потенциальном клиенте, он отправляет предложение ипотеки клиенту и ожидает его ответа. Если клиент звонит или отвечает письмом, что он отказывается от ипотеки, детали дела архивируются, работа с данным клиентом отменяется. Если по прошествии 2 недель ответа не будет, детали дела архивируются в базе службы поддержки, работа с данным клиентом отменяется.\n\nЕсли клиент в ответ на предложение отправляет заполненную форму и прикрепляет документы, дело передается в администрацию. В администрации оцениваются детали ипотеки.\n\nЕсли все необходимые документы не предоставлены, клиенту отправляется сообщение с запросом дополнить пакет документов в соответствии с ранее присланным списком. Если по прошествии 2 недель ответа не будет, детали дела обновляются, архивируются администрацией, но заносятся в базу службы поддержки работа с данным клиентом отменяется.\n\nЕсли пакет документов предоставлен в полном объеме, то оформление ипотечной заявки завершается. Информация об ипотечной заявке заносится в базу администрации. Процесс завершается.\n\nПримечание: предложение включает форму для заполнения и перечень необходимых документов, которые нужно прикрепить в ответном письме на предложение.\n\nЕсть две разных базы данных: одна службы поддержки, другая администрации",
  "дз3": "Лекция 2.\nЗадание 3\n\nПроцесс дистрибьюции воды (3 задание):\n\nВ этом примере вы являетесь сотрудником крупного дистрибьютора бутилированный воды.\nПроцесс невыполненного Заказа\nНевыполненные заказы происходят, когда клиент ранее заказал бутилированную воду определенной марки, и у нас не было достаточного запаса воды, которое он хотел. Итак, мы регистрируем отсутствующую воду как невыполненный заказ и уведомляем об этом клиента.\nПроцесс начинается, когда клиент уведомил нас, через форму по невыполненному заказу, о том, что он хочет сделать. Первое, что мы должны сделать, это найти исходный документ (заказ). В нем есть важная для нас информация. Затем мы смотрим, что клиент хочет сделать с невыполненным заказом. У него есть 3 варианта:\n1. подождать, пока нужная вода придет на склад. В этом случае мы ничего не делаем, процесс завершается;\n2. аннулировать заказ, здесь мы должны обновить предыдущий заказ и отправить подтверждение отмены Заказчику, после процесс завершается;\n3. принять альтернативную марку воды, которое мы первоначально предложили через примечание к невыполненному заказу.\nКогда клиент принимает нашу альтернативу, мы должны проверить, что у нас действительно есть запас воды альтернативной марки.\nЕсли он доступен, мы генерируем отгрузочную накладную на склад, а также генерируем накладную и процесс завершается.\nЕсли у нас нет воды альтернативной марки, это довольно неловко. Мы должны отправить еще одну форму с невыполненным заказом, объяснив, что у нас нет запаса, и извиниться. На этом процесс завершается",
  "homework": "Тут можно получить домашние задания или задания по лекциям. Ниже предоставлены кнопки – тыкай и погружайся в обучение!",
  "Книги": "Основная литература:\n\nИлья Корнипаев «Требования для программного обеспечения. Рекомендации по сбору и документированию»\n\nВигерс Карл «Разработка требований к программному обеспечению»",
  "Видеолекции": "Оп, смотрю ты решил(-а) посмотреть видосики, что ж, лови:\n\nЛекция на канале МИРЭА про BPMN: https://www.youtube.com/watch?v=XyAYr9M8yLkv \n\nАрхитектура Web Приложений / от простых до высоконагруженных\nhttps://www.youtube.com/watch?v=9mZmc6a0tmM&ab_channel=SeniorSoftwareVlogger",
  "Ресурсы": "Где можно попрактиковаться?\n\nhttps://storm.bpmn2.ru/ – bpmn storm\n\nhttp://bpmn.io/ – bpmn.io",
  "Статьи": "Выбери, по какой лекции хочешь почитать материал:",
  "Домашние задания": "Лекция 2.\n\nПроцесс страхования клиента\n\nПридя в страховую компанию, клиент сообщает менеджеру по работе с клиентами, что ему необходимо застраховать. Менеджер, выслушав клиента, выбирает агента, который занимается именно данным видом страхования, и передает ему всю информацию. На основе этой информации страховой агент объясняет клиенту условия страхования и предлагает наиболее оптимальный вариант страхования. Если клиент согласен, то происходит оформление договора по предложенному страховым агентом тарифу. После страховой агент выдает клиенту пакет документов.\n\nЕсли клиента не устраивает предложенный агентом тариф, то агент должен рассказать об альтернативных видах страхования. Если одна из альтернатив устраивает клиента то оформляется договор и выдается клиенту пакет документов.\n\nПри этом вне зависимости от выбранных условий страхования, сразу после оформления договора страховой агент должен сохранить информацию о договоре в системе электронной документации. Фиксируется дата заключения договора, страховая сумма, вид страхования, филиал, в котором заключался данный договор, тарифную ставку, информацию о клиенте и агенте.\n\nБывают также ситуации, когда клиента не устраивает ни один из предложенных альтернативных видов страхования. В таком случае агент рекомендует партнеров - дает клиенту буклет с контактной информацией партнеров и их видами страховых услуг.\n\nВне зависимости от того, оформил клиент договор или нет, менеджер по работе с клиентами выясняет оценку работы агента у клиента по десятибалльной шкале. Выяснив оценку, он должен сохранить информацию в базе отзывов в формате ФИО Агента - Оценка.\nПримечание: вид = условия = тариф страхования"
}